Revit 2027 API
ParameterFilterElement.GetElementFilterParameters Method
 Retrieves a list of the parameters associated with each rule in the filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetElementFilterParameters()
Public Function GetElementFilterParameters As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetElementFilterParameters()
member GetElementFilterParameters : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 A set of parameter identifiers.
Remarks
 This function returns only parameters used by this ParameterFilterElement that are common to all categories specified in this ParameterFilterElement. The ElementFilter may also contain parameters specific to one of the categories and not necessarily common to all categories specified in this ParameterFilterElement. To get those parameters, use ParameterFilterElement.GetElementFilterParametersForCategory().
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace